Revit 2024 API
AnalysisDisplayColoredSurfaceSettings.GridColor Property
 Color of grid lines.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2011
Syntax
C#
public Color GridColor { get; set; }
Visual Basic
Public Property GridColor As Color
	Get
	Set
Visual C++
public:
property Color^ GridColor {
	Color^ get ();
	void set (Color^ value);
}
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
AnalysisDisplayColoredSurfaceSettings Class
Autodesk.Revit.DB.Analysis Namespace